#+PROPERTY: header-args+ :cache yes
#+PROPERTY: header-args+ :comments org
#+PROPERTY: header-args+ :mkdirp yes
#+PROPERTY: header-args+ :noweb yes
#+PROPERTY: header-args+ :var fm=fav_music
#+PROPERTY: header-args:sh+ :var sc=system_ctl
#+PROPERTY: header-args:sh+ :var uc=user_ctl
#+PROPERTY: header-args:sh+ :var pm=pacman
* ArchLinux
  :PROPERTIES: 
  :header-args: :dir /sudo:: :results verbatim
  :END:

  Pacman config
  #+BEGIN_SRC conf :tangle /sudo::/etc/pacman.conf
    [options]
    VerbosePkgLists
    UseSyslog
    CheckSpace
    HoldPkg = pacman glibc
    Architecture = auto

    SigLevel = Required DatabaseOptional
    LocalFileSigLevel = Optional

    [core]
    Include = /etc/pacman.d/mirrorlist
    [extra]
    Include = /etc/pacman.d/mirrorlist
    [community]
    Include = /etc/pacman.d/mirrorlist
    [blackarch]
    Server = http://f.archlinuxvn.org/$repo/$repo/os/$arch
  #+END_SRC

  #+BEGIN_SRC conf :tangle /sudo::/etc/pacman.conf
    [multilib]
    Include = /etc/pacman.d/mirrorlist
  #+END_SRC

  #+BEGIN_SRC conf :tangle /sudo::/etc/pacman.d/mirrorlist
    Server = http://f.archlinuxvn.org/archlinux/$repo/os/$arch
  #+END_SRC

  Refresh database
  #+BEGIN_SRC sh
    $pm -S -y
  #+END_SRC

  AUR helper
  #+BEGIN_SRC yaml :tangle ~/Copy/bin/aur :shebang #!/bin/ansible-playbook
    - hosts: arch
      gather_facts: no
      vars:
        store: /tmp/aur
      vars_prompt:
        - name: package
          private: no
      tasks:
        - file: state=directory path={{store}}
        - get_url: url=https://aur4.archlinux.org/cgit/aur.git/snapshot/{{package}}.tar.gz dest={{store}}/
        - unarchive: copy=no src={{store}}/{{package}}.tar.gz dest={{store}}
        - command: nice makepkg --noconfirm --install --force --syncdeps chdir={{store}}/{{package}}
  #+END_SRC

  Yaourt config
  #+BEGIN_SRC conf :tangle ~/.yaourtrc
    AURUPGRADE=1
    EXPORT=1
    EXPORTDIR=~
    BUILD_NOCONFIRM=1
    EDITFILES=0
  #+END_SRC

  Base utils
  #+BEGIN_SRC sh
    $pm -S haveged p7zip parallel pkgfile yaourt
    $sc enable --now haveged
  #+END_SRC

  #+RESULTS:
  : :: Synchronizing package databases...
  :  core is up to date
  :  extra is up to date
  :  community                  0.0   B  0.00B/s 00:00 [----------------------]   0% community                  0.0   B  0.00B/s 00:00 [----------------------]   0% community                  0.0   B  0.00B/s 00:00 [----------------------]   0% community                  0.0   B  0.00B/s 00:00 [----------------------]   0% community                  0.0   B  0.00B/s 00:00 [----------------------]   0% community                 53.4 KiB  89.0K/s 00:31 [----------------------]   1% community                146.9 KiB   215K/s 00:12 [#---------------------]   5% community                221.4 KiB   268K/s 00:09 [#---------------------]   7% community                318.9 KiB   341K/s 00:07 [##--------------------]  11% community                393.7 KiB   352K/s 00:06 [##--------------------]  13% community                489.9 KiB   395K/s 00:05 [###-------------------]  17% community                562.8 KiB   385K/s 00:05 [####------------------]  19% community                622.9 KiB   326K/s 00:06 [####------------------]  21% community                756.1 KiB   439K/s 00:04 [#####-----------------]  26% community                845.6 KiB   442K/s 00:04 [######----------------]  29% community                928.4 KiB   431K/s 00:04 [#######---------------]  32% community                961.8 KiB   339K/s 00:05 [#######---------------]  33% community               1096.7 KiB   448K/s 00:03 [########--------------]  38% community               1174.2 KiB   428K/s 00:03 [#########-------------]  41% community               1261.0 KiB   430K/s 00:03 [#########-------------]  44% community               1346.5 KiB   429K/s 00:03 [##########------------]  47% community               1437.4 KiB   437K/s 00:03 [###########-----------]  50% community               1514.9 KiB   419K/s 00:03 [###########-----------]  53% community               1609.7 KiB   437K/s 00:02 [############----------]  56% community               1695.2 KiB   434K/s 00:02 [############----------]  59% community               1779.4 KiB   427K/s 00:02 [#############---------]  62% community               1874.2 KiB   443K/s 00:02 [##############--------]  65% community               1949.0 KiB   420K/s 00:02 [##############--------]  68% community               2038.6 KiB   422K/s 00:01 [###############-------]  71% community                  2.1 MiB   433K/s 00:01 [################------]  74% community                  2.2 MiB   426K/s 00:01 [################------]  77% community                  2.2 MiB   409K/s 00:01 [#################-----]  80% community                  2.3 MiB   398K/s 00:01 [##################----]  82% community                  2.4 MiB   405K/s 00:00 [##################----]  86% community                  2.5 MiB   426K/s 00:00 [###################---]  89% community                  2.6 MiB   420K/s 00:00 [####################--]  92% community                  2.7 MiB   440K/s 00:00 [####################--]  95% community                  2.7 MiB   416K/s 00:00 [#####################-]  98% community                  2.8 MiB   416K/s 00:07 [######################] 100%
  :  multilib is up to date
  :  blackarch is up to date
  :  there is nothing to do

  #+BEGIN_SRC sh
    pkgfile -u
  #+END_SRC

  #+RESULTS:
  
  Dev-env:
  #+BEGIN_SRC sh
    $pm -S base-devel rust git ansible android-tools
  #+END_SRC

  Monitoring:
  #+BEGIN_SRC sh
    $pm -S ethtool lm_sensors net-tools psmisc \
        procps-ng inetutils ltrace sysdig atop iotop
  #+END_SRC
  
  #+RESULTS:
  
  #+BEGIN_SRC sh :tangle ~/Copy/bin/strace :shebang #!/bin/sh :no-expand
    exec /usr/bin/ltrace -CSn2 $@
  #+END_SRC

  Of course emacs is installed, now run it
  #+BEGIN_SRC sh
    $pm -S emacs-pkgbuild-mode
  #+END_SRC

  #+RESULTS:
  :  there is nothing to do

  #+BEGIN_SRC conf :tangle ~/.config/systemd/user/emacs.service
    [Unit]
    Description=Emacs

    [Service]
    ExecStart=/usr/bin/emacs
    Restart=always
    RestartSec=1sec

    [Install]
    WantedBy=default.target
  #+END_SRC

  #+BEGIN_SRC sh :dir ~
    $uc enable --now emacs
  #+END_SRC

  #+RESULTS:

